class BaseDictionaryFrRu {
  static String dic = '''
Oui [Уи] - Да
Non [Нон] - Нет
Merci (merci beaucoup) [Мерси (мерси боку)] - Спасибо (большое спасибо)
Je vous en prie. [Жё вузан при.] - Пожалуйста (ответ на спасибо)
De rien [До рьен] - Не за что
S’il vous plaît [Силь ву плэ] - Пожалуйста (просьба)
Pardon / excusez-moi [Пардон / экскюзе муа] - Извините
Bonjour [Бонжур] - Здравствуйте
Au revoir [О ревуар] - До свидания
A bientôt [А бьенто] - Пока
Je ne comprends pas. [Жё нё компран па] - Я не понимаю.
Parlez-vous … russe ? [Парле-ву … рюс?] - Вы говорите … по-русски?
…anglais ? […англэ?] - …по-английски?
…français ? […франсэ?] - …по-французски?
Je ne parle pas … français. [Жё нё парль па … франсэ.] - Я не говорю … по-французски.
Monsieur, madame… [Мёсьё, мадам…] - Господин, госпожа…
Plus lentement,s’il vous plaît. [Плю лянтман,силь ву плэ.] - Помедленнее,пожалуйста.
Aidez-moi, s’il vous plaît. [Эдэ-муа, силь ву плэ.] - Помогите мне, пожалуйста.
J’ai besoin de… [Жэ бёзуэн до] - Мне нужно…
 Как вас зовут?] - [Коман вузапле ву?] Comment vous appelez-vous?
Je m’appelle … [Жё мапель…] - Меня зовут…
Enchanté ! [Аншантэ!] - Очень приятно!
Comment allez-vous ? [Коман тале ву?] - Как у вас дела?
Bien / bon / ça va [Бьен / бон / са ва] - Хорошо.
Comme ci comme ça. [Ком си ком са.] - Так себе.
C’est mon / ma … [Сэ мон / ма…] - Это мой / моя…
…femme. […фам.] - …жена.
…mari. […мари.] - …муж.
…fille. […фий.] - …дочь.
…fils. […фис.] - …сын.
…mère / maman. […мэр / маман.] - …мать / мама.
…père / papa. […пэр / папа.] - …отец / папа.
…ami / amie. […ами / ами.] - ..друг / подруга.
Je viens de Russie. [Жё вьен де Рюси.] - Я из России.
Nous venons de Russie. [Ну венон де Рюси.] - Мы из России.
Où se trouve… ? [У сё трув…?] - Где находится…?
L’hôtel [Лётэль] - Отель
Le restaurant [Лё рэсторан] - Ресторан
Le magasin [Лё магазэн] - Магазин
Le musée [Лё мюзе] - Музей
La rue [Ля рю] - Улица
La place [Ля пляс] - Площадь
L’aéroport [Ляэропор] - Аэропорт
La gare [Ля гар] - Вокзал жд
La gare routière [Ля гар рутьер] - Автовокзал
L’arrêt [Лярэ] - Остановка
Le bus [Лё бюс] - Автобус
Le tram [Лё трам] - Трамвай
Le train [Лё трэн] - Поезд
L’avion [Лявьон] - Самолет
Le métro [Лё метро] - Метро
Le taxi [Лё такси] - Такси
La voiture [Ля вуатюр] - Автомобиль
Le départ [Лё дэпар] - Отправление
L’arrivée [Ляривэ] - Прибытие
Le billet [Лё бийе] - Билет
Quel est le prix d’un billet ? [Кэль э лё при дон бийе?] - Сколько стоит билет?
A gauche [А гош] - Налево
A droite [А друат] - Направо
Tout droit [Ту друа] - Прямо
Où sont les toilettes ? [У сон ле туалет?] - Где находятся туалеты?
Combien ça coûte ? [Комбьен са кут?] - Сколько это стоит?
Quel est le prix ? [Кэль э лё при?] - Какова цена?
Je voudrais acheter / commander… [Жё вудрэ аштэ / командэ…] - Я хотел(а) бы купить / заказать…
Avez-vous… ? [Аве ву?] - У вас есть…?
Je le prends. [Жё лё пран.] - Я это беру.
Acceptez-vous les cartes de crédit ? [Аксепте ву ле карт до креди?] - Вы принимаете кредитные карты?
Ouvert [Увер] - Открыто
Fermé [ферме] - Закрыто
Le petit déjeuner [Лё пти дежёне] - Завтрак
Le déjeuner [Лё дежёне] - Обед
Le dîner [Лё дине] - Ужин
L’addition, s’il vous plaît. [Лядисьон, силь ву плэ.] - Счет, пожалуйста.
Du pain [Дю пэн] - Хлеб
Du café [Дю кафе] - Кофе
Du thé [Дю тэ] - Чай
Du jus [Дю жю] - Сок
De l’eau [До лё] - Вода
De la bière [До ля бьер] - Пиво
Du vin [Дю вэн] - Вино
Du sel [Дю сэль] - Соль
Du poivre [Дю пуавр] - Перец
De la viande [До ля вьянд] - Мясо
Du boeuf [Дю бёф] - Говядина
Du porc [Дю пор] - Свинина
Du poisson [Дю пуасон] - Рыба
De la volaille [До ля волай] - Птица
Des légumes [Дэ легюм] - Овощи
Des fruits [Дэ фрюи] - Фрукты
Des pommes de terre [Дэ пом до тэр] - Картошка
Une glace [Юн гляс] - Мороженое
un , une [эн, юн] - 1 — один,одна
deux [дё] - 2 — два, две
trois [труа'] - 3 — три
quatre [катр] - 4 — четыре
cinq [сэнк] - 5 — пять
six [сис] - 6 — шесть
sept [сэт] - 7 — семь
huit [юи'т] - 8 — восемь
neuf [нёф] - 9 — девять
dix [дис] - 10 — десять
onze [онз] - 11 — одиннадцать
douze [дуз] - 12 — двенадцать
treize [трэз] - 13 — тринадцать
quatorze [като'рз] - 14 — четырнадцать
quinze [кэнз] - 15 — пятнадцать
seize [сэз] - 16 — шестнадцать
dix-sept [дис-сэт] - 17 — семнадцать
dix-huit [диз-юи'т] - 18 — восемнадцать
dix-neuf [диз-нёф] - 19 — девятнадцать
vingt [вэн] - 20 — двадцать
vingt-et-un (une) [вэн-т-э-эн (юн)] - 21 — двадцать один
vingt-deux [вэн-дё] - 22 — двадцать два
vingt-trois [вэн-труа'] - 23 — двадцать три
trente [трант] - 30 — тридцать
trente et un [тран-тэ-эн] - 31 — тридцать один
trente-deux [трант-дё] - 32 — тридцать два
quarante [кара'нт] - 40 — сорок
quarante et un [каран-тэ-эн] - 41 — сорок один
quarante-deux [карант-дё] - 42 — сорок два
cinquante [сэнка'нт] - 50 — пятьдесят
cinquante et un [сэнка'н-тэ-эн] - 51 — пятьдесят один
cinquante-deux [сэнкант-дё] - 52 — пятьдесят два
soixante [суаса'нт] - 60 — шестьдесят
soixante et un [суаса'н-тэ-эн] - 61 — шестьдесят один
soixante deux [суаса'нт-дё] - 62 — шестьдесят два
soixante-dix [суаса'нт-ди'с] - 70 — семьдесят
soixante et onze [суаса'нт-о'нз] - 71 — семьдесят один
soixante-douze [суаса'нт-ду'з] - 72 — семьдесят два
quatre-vingts [катрё-вэн] - 80 — восемьдесят
quatre-vingt et un [катрё-вэн-тэ-эн] - 81 — восемьдесят один
quatre-vingt-deux [катрё-вэн-дё] - 82 — восемьдесят два
quatre-vingt-dix [катрё-вэн-дис] - 90 — девяносто
quatre-vingt-onze [катрё-вэн-то'нз] - 91 — девяносто один
quatre-vingt-douze [катрё-вэн-ду'з] - 92 — девяносто два
cent [сан] - 100 —сто
cent un [сантэн] - 101 — сто один
cent deux [сан дё] - 102 — сто два
cent dix [сан дис] - 110 — сто десять
cent vingt [сан вэн] - 120 — сто двадцать
cent soixante-dix [сан суаса'нт-дис] - 170 — сто семьдесят
cent soixante-quinze [сан суаса'нт-кэнз] - 175 — сто семьдесят пять
cent soixante-dix-huit [сан суаса'нт-диз-юи'т] - 178 — сто семьдесят восемь
cent quatre-vingts [сан катрё-вэн] - 180 — сто восемьдесят
cent quatre-vingts six [сан катрё-вэн сие] - 186 — сто восемьдесят шесть
cent quatre-vingt-dix [сан катрё-вэн-дис] - 190 — сто девяносто
cent quatre-vingt-dix-sept [сан катрё-вэн-дис-еэт] - 197 — сто девяносто семь
deux cents [дё сан] - 200 — двести
deux cent un [дё сан-тэн] - 201 — двести один
deux cent deux [дё сан дё] - 202 — двести два
trois cents [труа сан] - 300 — триста
quatre cents [катрё са'н] - 400 — четыреста
cinq cents [сэнк са'н] - 500 — пятьсот
six cents [си са'н] - 600 — шестьсот
sept cents [сэт са'н] - 700 — семьсот
huit cents [юи са'н] - 800 — восемьсот
neuf cents [нёф са'н] - 900 — девятьсот
mille [миль] - 1000 — тысяча
deux mille [дё миль] - 2000 — две тысячи
un million [эн мильо'н] - 1 000 000 — миллион
un milliard [эн мильяр] - 1 000 000 000 — миллиард
''';
}